package main

import (
	"fmt"
	"io"
	"strings"
)

func main() {
	// Создаем ридер из строки
	r := strings.NewReader("Hello World")

	// Создаем буфер (массив байт) размером 4 байта.
	// Мы будем читать строку порциями по 4 байта за итерацию.
	buf := make([]byte, 6)

	for {
		// Читаем данные из ридера r в наш буфер buf
		n, err := r.Read(buf)

		// Если дошли до конца файла (потока), прерываем цикл
		if err == io.EOF {
			fmt.Printf("Конец потока: n = %d, err = %v\n", n, err)
			break
		}

		// Выводим информацию о текущей итерации:
		// n — сколько байт прочитано, buf[:n] — срез буфера с актуальными данными.
		// Флаг %q красиво форматирует байты в виде читаемой строки.
		fmt.Printf("Прочитано байт: %d, Данные: %q\n", n, buf[:n])
	}
}
